/*Lec_141__React_Styles in React_CSS и SASS_SCSS.js
            https://www.npmjs.com/package/sass

0:45. Работа с файлами SASS
на 2020 год препроцессор Less не поддерживается. 
1:50. Импорт SCSS в наш JS - без установки npm модуля SCSS не работает.
2:30. Вместо node-sass теперь ставится просто пакет sass.
2:50. Установка пакета sass:

        npm i sass --save

3:50. Использование переменных в SCSS. 
5:20. Импорт переменных. Для корректного использования глобального файла переменных, этот файл надо импортировать
этот файл в каждый файл со стилями внутри иерархии проекта. 
7:10. Отображение стилей в ДОМ дереве. В режиме разработки стили собираются webpack-ом в тегах, 
а в финальной сборке в режиме продукта стили будут вставляться как стили. 

 */