/*Lec_146__React_Styles_Class fields and static.js
                https://habr.com/ru/post/464261/            - Статья о понятии API
                https://github.com/public-apis/public-apis  - репозиторий открытых API.

                Открытые API из урока 
                https://anapioficeandfire.com/              - Игра престолов
                https://pokeapi.co/                         - Покемоны
                https://developer.marvel.com/               - Марвел
                https://openweathermap.org/api              - Погода
                https://newsapi.org/                        - Новости

                    ***********************
0:20. API это набор уже готовых функций и свойств, которые мы можем использовать.        
2:35. Этапы работы API:
        1. Как мы выполняем саму операцию. Можно отправить Get? Post запрос или запустить скрипт. 
        2. Что мы даем API, какие данные. Это могут быть данные регистрации, пароль и т.д. 
        3. Результат: активация данных, включился поиск устройств и т.д. 
4:00. Бесплатные API для Фронта:
4:25. API Игра престолов. 
6:10. API Игра престолов. https://anapioficeandfire.com/Documentation - Documentation
6:30. Ограничения по запросам This limit is set to 20000 requests per day.  20 тыс. запросов в день. 
7:30. API Покемоны. В этом API нет изображений
8:25. API Марвел. С ним будем работать в данном модуле.
9:40. Важный ньюанс! Так как это чужой сервис - то его работа и дрступность не контролируется в этом модуле.
10:35. API Погода.
10:50. API Новости.
11:15. API Репозиторий открытых API. Их надо тестировать, т.к. не все они работают, не все в формате JSON и не все на JS.

*/