'use strict';

/* 0:15. NPM пакеты - Эко кусочки кода, которые лежат на отдельных серверах. 
Которые мы можем устанавливать себе в проет и использовать.
  Метод filter() создаёт новый массив со всеми элементами,
прошедшими проверку, задаваемую в передаваемой функции.
Вернётся новый массив с элементами, которые прошли проверку. 
Если ни один элемент не прошёл проверку, то будет возвращён пустой массив.

1:25 Создание NPM проекта.
3:20 Установка NPM пакета, который будем использовать внутри проекта.
Terminal: npn i json-server 
4:05 Различия пакотов. Локально. Глобально.
    - Глобально. Будет работать в любой части нашей системы. - Неважно в каком проекте или папке мы его запускаем.
    используется для проверяющих утилит к различным проектам.
- Локально. Для конкретного проекта.
5:05 sudo - Для Мак ОС.
5:50 - Указание флага. Используется ли он при разработке или работе проекта и т.д.
        --save-dev - Ключ для фейкового окружения (опен сервер) и тестирования функционала.
    Terminal: npm i json-server --save-dev
6:30 - Ключ для использования библиотек внутри проекта (Jqwery, React  и др.):
        --save  
3:20
3:20
3:20
3:20
*/