'use strict';

/*   Lec 91.    Lec_91_Library of axios. Библиотека для работі с запросами.
1:10. Раздел Installing  на сайте библиотеки.
1:45. 2 варианта установки:
        - скачивание в папку проекта.
        - вставка ссылки в HTML.
2:30. Вставка ссылки на axios в HTML. вставлять необходимо перед главным скриптом.
        Осторожно с asink & defer.
4:30. Использование библиотеки axios.
5:10. Применение библиотеки axios в проете Food.
7:20. Вставка в наш скрипт.
8:25. Схема ответа на https://axios-http.com/ru/docs/res_schema
*/